In [122]:
import pandas as pd

df = pd.read_csv('players_big.csv')
df.head()

,name,team,date_of_birth,palce_of_birth,role,height,test_bat_rank,odi_bat_rank,t20_bat_rank,test_bow_rank,...,BW_IPL_B,BW_IPL_Runs,BW_IPL_Wkts,BW_IPL_BBI,BW_IPL_BBM,BW_IPL_Econ,BW_IPL_Avg,BW_IPL_SR,BW_IPL_5W,BW_IPL_10W
0,Sachin Tendulkar,India,"Apr 24, 1973 (49 years)","Bombay (now Mumbai), Maharashtra",Batsman,5 ft 5 in,--,--,--,--,...,36,58,0,0/7,0/7,9.67,0.0,0.0,0,0
1,Virender Sehwag,India,"Oct 20, 1978 (44 years)",Delhi,Batsman,5 ft 8 in (173 cm),--,--,--,--,...,136,235,6,2/18,2/18,10.37,39.17,22.67,0,0
2,Rahul Dravid,India,"Jan 11, 1973 (49 years)","Indore, Madhya Pradesh",Batsman,--,--,--,--,--,...,-,-,-,-,-,-,-,-,-,-
3,VVS Laxman,India,"Nov 01, 1974 (48 years)","Hyderabad, Andhra Pradesh",--,--,--,--,--,--,...,-,-,-,-,-,-,-,-,-,-
4,Sourav Ganguly,India,"Jul 08, 1972 (50 years)","Calcutta (now Kolkata), Bengal",Batsman,5 ft 11 in,--,--,--,--,...,276,363,10,2/21,2/21,7.89,36.3,27.6,0,0

### 1. How many teams of data we're having?

In [123]:
df['team'].nunique()

75

### 2. Which team has the least number of players?

In [183]:
df.groupby('team').size().sort_values().head()

team
Japan           1
Fiji            5
Bahamas        12
Cyprus         12
Isle of Man    12
dtype: int64

### 3. Which team has the most number of players?

In [184]:
df.groupby('team').size().sort_values(ascending = False).head()

team
England         756
India           615
Australia       534
South Africa    414
West Indies     386
dtype: int64

### 4. How many players are there from team India?

In [126]:
len(df[df['team'] == 'India'])

615

### 5. Oldest player in the history of Indian Cricket

In [152]:
df_pr = df[df['team'] == 'India']

birth_year  = []

for _ in df_pr['date_of_birth']:
    birth_year.append(int(_.split(' ')[2]))
    
df_pr_ = pd.DataFrame(df_pr['name'], columns = ['name'])
df_pr_['birth_year'] = birth_year
df_pr_.sort_values(by = 'birth_year').head()

                    name  birth_year
2682  Rustomji Jamshedji        1892
2675          C.K.Nayudu        1895
3544     Cotar Ramaswami        1896
2684         Ladha Ramji        1900
2670       Sorabji Colah        1902

### 6. Oldest player in the history of Cricket

In [151]:
birth_year  = []

for _ in df['date_of_birth']:
    try:
        birth_year.append(int(_.split(' ')[2]))
    except:
        birth_year.append(2100)
    
df_pr_ = pd.DataFrame(df['name'], columns = ['name'])
df_pr_['birth_year'] = birth_year
df_pr_.sort_values(by = 'birth_year').head()

                  name  birth_year
2045  James Southerton        1827
2991       Nat Thomson        1839
2987       Ned Gregory        1839
2041        Harry Jupp        1841
2038        Tom Emmett        1841

### 7. Which player has played most number of matches as a batsman all together (Test, ODI, T20, IPL)?

In [149]:
def get_matches(i):
    
    s = 0
    for _ in i.split(' '):
        if _ != '-':
            s += int(_)
    return s

df['matched_played'] = df['BT_Test_M']  + ' ' +  df['BT_IPL_M']  + ' ' + df['BT_ODI_M']  + ' ' +  df['BT_T20I_M']

total_matches = []

for i in df['matched_played']:
    total_matches.append(get_matches(i))
    
df['matched_played'] = total_matches

df.sort_values(by = 'matched_played', ascending = False).head()

,name,team,date_of_birth,palce_of_birth,role,height,test_bat_rank,odi_bat_rank,t20_bat_rank,test_bow_rank,...,BW_IPL_Runs,BW_IPL_Wkts,BW_IPL_BBI,BW_IPL_BBM,BW_IPL_Econ,BW_IPL_Avg,BW_IPL_SR,BW_IPL_5W,BW_IPL_10W,matched_played
143,MS Dhoni,India,"Jul 07, 1981 (41 years)","Ranchi, Bihar (now Jharkhand)",WK-Batsman,5 ft 11 in (180 cm),--,--,--,--,...,-,-,-,-,-,-,-,-,-,772
0,Sachin Tendulkar,India,"Apr 24, 1973 (49 years)","Bombay (now Mumbai), Maharashtra",Batsman,5 ft 5 in,--,--,--,--,...,58,0,0/7,0/7,9.67,0.0,0.0,0,0,742
46,Mahela Jayawardene,Sri Lanka,"May 27, 1977 (45 years)",Colombo,Batsman,--,--,--,--,--,...,-,-,-,-,-,-,-,-,-,732
558,Virat Kohli,India,"Nov 05, 1988 (34 years)",Delhi,Batsman,5 ft 9 in (175 cm),11,10,13,--,...,368,4,2/25,2/25,8.8,92.0,62.75,0,0,706
48,Kumar Sangakkara,Sri Lanka,"Oct 27, 1977 (45 years)",Matale,Batsman,--,--,--,--,--,...,-,-,-,-,-,-,-,-,-,665

### 8. Which team's players has scored most number of runs in Test (as batsman)?

In [173]:
df_pr = df[df['BT_Test_Runs'] != '-']

df_pr['BT_Test_Runs'] = [int(i) for i in df_pr['BT_Test_Runs'].values]

df_pr.groupby('team')['BT_Test_Runs'].sum().sort_values(ascending = False).head()

/var/folders/rq/lwddjvtn5n9gjw05hwrg3hp80000gp/T/ipykernel_8277/3614852922.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_pr['BT_Test_Runs'] = [int(i) for i in df_pr['BT_Test_Runs'].values]

team
England         486145
Australia       418457
India           268186
West Indies     262199
South Africa    211013
Name: BT_Test_Runs, dtype: int64

### 9. Which team's players has scored most number of runs in ODI (as batsman)?

In [175]:
df_pr = df[df['BT_ODI_Runs'] != '-']

df_pr['BT_ODI_Runs'] = [int(i) for i in df_pr['BT_ODI_Runs'].values]

df_pr.groupby('team')['BT_ODI_Runs'].sum().sort_values(ascending = False).head()

/var/folders/rq/lwddjvtn5n9gjw05hwrg3hp80000gp/T/ipykernel_8277/318532769.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_pr['BT_ODI_Runs'] = [int(i) for i in df_pr['BT_ODI_Runs'].values]

team
India        215430
Australia    209809
Pakistan     193856
Sri Lanka    174753
England      160135
Name: BT_ODI_Runs, dtype: int64

### 10. Which role is having most number of players through the dataset?

In [182]:
df.groupby('role').size().sort_values(ascending = False).head()

role
--                    1558
Bowler                1116
Batsman                809
Batting Allrounder     460
WK-Batsman             353
dtype: int64